In [2]:
import os
import mysql.connector as connection
import pandas as pd
from dotenv import load_dotenv
from loggers import logger
load_dotenv()

True

In [3]:
try:
    mydb = connection.connect(
        host=os.getenv('HOST'),
        user=os.getenv('USER'),
        password=os.getenv('PASSWORD'),
        database=os.getenv('DATABASE')
    )
    query = "Select * from employee;"
    result_dataFrame = pd.read_sql(query,mydb)
    
except Exception as e:
    logger.error(e)

In [4]:
result_dataFrame.head()

   id     name  salary
0   1  Ranjith   10000
1   2     arun   20000
2   3    Ashok   15000
3   4    Rahul   22000

# Indexing

In [5]:
result_dataFrame.loc[0]

id              1
name      Ranjith
salary      10000
Name: 0, dtype: object

# Slicing

In [6]:
result_dataFrame.loc[0:2]

   id     name  salary
0   1  Ranjith   10000
1   2     arun   20000
2   3    Ashok   15000

In [7]:
result_dataFrame.loc[:1]

   id     name  salary
0   1  Ranjith   10000
1   2     arun   20000

# Summarize data

In [8]:
result_dataFrame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   id      4 non-null      int64
 1   name    4 non-null      object
 2   salary  4 non-null      int64
dtypes: int64(2), object(1)
memory usage: 224.0+ bytes

In [9]:
result_dataFrame.describe()

             id        salary
count  4.000000      4.000000
mean   2.500000  16750.000000
std    1.290994   5377.421935
min    1.000000  10000.000000
25%    1.750000  13750.000000
50%    2.500000  17500.000000
75%    3.250000  20500.000000
max    4.000000  22000.000000